package GoF;

/**
 * 【UML】
 *       成员变量 ———— 可见性 名称 : 类型 = 默认值
 *       成员方法 ———— 可见性 名称(参数列表) : 返回值类型
 *                     +    public
 *                     -    private
 *                     #    protected
 *                     *    default
 *       关联关系 ———— 一个类的对象作为另一个类的成员变量
 *                    单向关联、自关联、双向关联、多重关联   ————>
 *                    聚合 == 相互独立的整体与部分        ◇————>
 *                           1、构造注入
 *                           2、Setter 注入
 *                           3、方法参数注入
 *                    组合 == 同生共死的整体与部分        ◆————>
 *                           一般在构造方法中直接实例化
 *       依赖关系 ———— 一个类使用另一个类  ---->
 *                    1、方法参数
 *                    2、方法局部变量
 *                    3、方法中调用另一个类的静态方法
 *       继承  ————▷
 *       实现  ----▷
 */

public class Principle {
}
