package leetcode.LC_Linked;

/**
 * 链表归并系列：<p>
 *       21 ：合并 2 个有序链表
 *       23 ：合并 k 个有序链表
 *      148 ：排序链表
 * <hr>
 * 搜索并处理系列：<p>
 *      203 ：删除节点值为 val 的节点
 *      237 ：删除给定节点 node
 *      160 ：找两个链表相交的第一个公共节点
 *        2 ：模拟加法，且 head 为最低位，即个位
 * <hr>
 * 快慢指针系列：<p>
 *       19 ：删除倒数第 n 个节点
 *      【走法一】
 *      876 ：链表的中间结点（偶数个节点时选中间偏右的）
 *      234 ：判断链表是否回文
 *      141 ：判断链表是否有环
 *      【走法二】
 *      142 ：寻找环入口
 * <hr>
 * 其他：
 *      138 ：深拷贝链表
 *      206 ：翻转链表
 *       25 ：k 个一组翻转链表，最后不足 k 个的一组不翻转
 *       24 ：两两交换链表中的相邻节点
 *      328 ：拆分奇偶位链表
 */

public class Note {
}
